import {FC} from "hono/jsx";

export const HomePage: FC = () =>
  <>
    <h1>Δημιουργία site</h1>
    <div className="p1">
      <p>
          Ονομάζομαι Ντυμένος Ραφαήλ, απόφοιτος του Χαροκόπειου Πανεπιστημίου του τμήματος
          Πληροφορικής και Τηλεματικής.
      </p>
      <p>
          Πρακτική άσκηση έκανα στην Εταιρεία Dion με τον ρόλο του Software engineer για τρείς
          μήνες. Κατά την διάρκεια των τριών μηνών ανέπτυξα reusable και typesafe React components
          χρησιμοποιώντας TypeScript, βελτιώνοντας τη συντηρησιμότητα και την επεκτασιμότητα του
          κώδικα. Επιπλέον συνεργάστηκα με την ομάδα των engineers για την επέκταση της λειτουργικότητας
          στην υπάρχουσα εφαρμογή. Τέλος συμμετείχα ενεργά σε αναθεωρήσεις κώδικα και συνέβαλα στη
          βελτίωση της συνολικής ροής.
      </p>
      <p>
          Έχω φτιάξει website με την χρήση της Typescript. Τα αποτελέσματα της δουλειάς που έχω
          κάνει μπορείτε να το δείτε στην ενότητα Jobs.
      </p>
      <p>
          Κατά την διάρκεια των σπουδών μου έχω ασχοληθεί με C , Java , Typescript , MySQL
          και Python. Η πτυχιακή μου εργασία ήταν πάνω στην εξαγωγή γνώσης από δεδομένα
          οδήγησης
      </p>
    </div>
  </>

